---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.HideAllBarsInRebarSet
source: html/b9909bdf-e56a-6be9-6f81-4939963501af.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.HideAllBarsInRebarSet Property

All Bars in Rebar Set have been hidden.

## Syntax (C#)
```csharp
public static FailureDefinitionId HideAllBarsInRebarSet { get; }
```